Revit 2027 API
RebarShapeParameters.IsValidExternalDefinition Method
 Checks that an ExternalDefinition (shared parameter) may be used as a Rebar Shape parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidExternalDefinition(
	ExternalDefinition param
)
Public Shared Function IsValidExternalDefinition (
	param As ExternalDefinition
) As Boolean
public:
static bool IsValidExternalDefinition(
	ExternalDefinition^ param
)
static member IsValidExternalDefinition :
        param : ExternalDefinition -> bool
Parameters
param ExternalDefinition
 Definition of a shared parameter.
Return Value
Boolean
 True if the definition is of type Length, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A Rebar Shape parameter must be an ExternalDefinition with a ParameterType of Length.
See Also
Reference
RebarShapeParameters Class
Autodesk.Revit.DB.Structure Namespace